import requests,time,json,random,geoip2.database,datetime
from PIL import Image,ImageDraw
import socket
def getHostIp():
    ip=requests.get("https://api.ipify.org/").text

    return ip
def holiday():
    try:
        a=json.loads(requests.get("https://timor.tech/api/holiday/year").text)
        if a["holiday"].get(time.strftime("%m-%d"))==None or "补班" in a["holiday"].get(time.strftime("%m-%d")).get("name"):
            return ""
        else:
            return a["holiday"].get(time.strftime("%m-%d")).get("name")
    except:
        return ""
def famous():
    famouses="""11、一寸光阴一寸金，寸金难买寸光阴。

21、人需要真理，就像瞎子需要明快的引路人一样。——高尔基

31、人的美德的荣誉比他的财富的荣誉不知大多少倍。——达·芬奇

41、时间最不偏私，给任何人都是二十四小时；时间
也最偏私，给任何人都不是二十四小时。——赫胥黎

51、人的天职在勇于探索真理。——哥白尼

61、恨不得挂长绳于青天，糸此西飞之白日。——李白

71、世界上最快而又最慢，最长而又最短，最平凡而又
最珍贵，最易被忽视而又最令人后悔的就是时间。——高尔基

81、真正的敏捷是一件很有价值的事。因为时间是衡量
事业的标准，如金钱是衡量货物的标准。——弗·培根

91、选择机会，就是节省时间。——培根

10、时间是我的财产，我的田亩是时间。——歌德

11、白日去如箭，达者惜今阳。——朱敦儒

12、明日复明日，明日何其多！日日待明日，万事成蹉跎
。世人皆被明日累，明日无穷老将至。晨昏滚滚水东流。今古
悠悠日西坠。百年明日能几何？请君听我《明日歌》。——文嘉

13、黄河走东溟，白日落西海，逝川与流光，飘忽不相待。——李白

14、生活的情况越艰难，我越感到自己更坚强，甚而也更聪明。
——高尔基

15、世有伯乐，然后有千里马。——韩愈

16、任何问题都有解决的办法，无法可想的事是没有的。——爱迪生

17、世界上最可宝贵的就是“今”，最容易丧失的也是“今”因为他最
容易丧失，所以更觉得他宝贵。——李大钊

18、浪费时间是所有支出中最奢侈及最昂贵的。——富兰克林

19、“世俗有时间是金钱”这句话，所以窃取他人时间的小偷，当然
该加以处罚，即使是那些愉快的好人，还是该如忌讳疾病地躲避他们。
——卡耐基

20、莫待萧萧两鬃丝！——朱学勉

21、如果我比笛卡尔看得远些，那是因为我站在巨人们的肩上的缘故。
——牛顿

22、劝君着意惜芳菲，莫待行人攀折荆。

23、莫等闲，白了少年头，空悲切。——岳飞

24、生活便是寻求新的知识。——门捷列夫

25、昨天只是今天的回忆，明天只是今天的梦。——吉卜龄

26、浪费时间叫虚度，剥用时间叫生活。——扬格

27、人们常觉得准备的阶段是在浪费时间，只有当真正机会来临，而自己
没有能力把握的时候，才能觉悟自己平时没有准备才是浪费了时间。
——罗曼·罗兰

28、你若是爱千古，你应该爱现在；昨日不能唤回来，明日还是不实在；
你能确有把握的，只有今日的现在。——爱默生

29、人生不是一种享乐，而是一桩十分沉重的工作。——列夫·托尔斯泰

30、人们说生命是很短促的，我认为是他们自己使生命那样短促的。由于
他们不善于利用生命，所以他们反过来抱怨说时间过得太快；可是我认为
，就他们那种生活来说，时间倒是过得太慢了。——卢梭

31、光阴可惜，譬诸逝水，当博览机要，以济功业。——颜之推

32、人生太短，要干的事太多，我要争分夺秒。——爱迪生

33、时间是由分秒积成的，善于利用零星时间的人，才会做出更大的成绩
来。——华罗庚

34、时难得而易失也。——贾谊

35、今是生活，今是动力，今是行为，今是创作。——李大钊

36、生活的全部意义在于无穷地探索尚未知道的东西，在于不断地增加更
多的知识。——左拉

37、事在人为：一年可以等于二年、三年，例如每天用十七、八小时读书；
反之，二、三年也可以等于一年，甚至比一年还少，例如每天只用五六小
时以下读书，我决心每天用十六到十八小时翻阅中国历代文集。——蔡尚思

38、人的知识愈广，人的本身也愈臻完善。——高尔基

39、人的智慧掌握着三把钥匙，一把开启数字，一把开启字母，一把开启
音符。知识、思想、幻想就在其中。——雨果

40、对时间的慷慨，就等于慢性自杀。——奥斯特洛夫斯基

41、时间，就象海棉里的水，只要愿挤，总还是有的。——鲁迅

42、生活的理想，就是为了理想的生活。——张闻天

43、据我观察，大部分人都是在别人荒废的时间里崭露头角的。——福特

44、不要懒懒散散地虚度生命。——贝多芬

45、人的生命是有限的，可是，为人民服务是无限的，我要把有限的生命，
投入到无限的为人民服务之中去。——雷锋

46、青年时种下什么，老年时就收获什么。——易卜生

47、光景不待人，须臾发成丝。——李白

48、盛年不重来，一日难再晨，及时宜自勉，岁月不待人。——陶潜

49、把握住今天，胜过两个明天。

50、凡是想获得优异成果的人，都应该异常谨慎地珍惜和支配自己的时间。
——克鲁普斯卡娅

51、生活最沉重的负担不是工作，而是无聊。——罗曼·罗兰

52、时间是一位可爱的恋人，对你是多么的爱慕倾心，每分每秒都在叮嘱；
劳动、创造、别虚度了一生。——于沙

53、正当利用时间！你要理解什么，不要舍近求远。——歌德

54、如果有什么需要明天做的事，最好现在就开始。——富兰克林

55、不要贬低黄昏，黄昏同清晨一样是成就事业的时间。——天雄

56、三更灯火五更鸡，正男儿立志时。黑发不知勤学早，白首方悔读书迟。
——颜真卿

57、时间是伟大的作者，她能写出未来的结局。——卓别林

58、时间就是速度，时间就是力量。——郭沫若

59、生命的意义在于付出，在于给予，而不是在于接受，也不是在于争取。
——巴金

60、生命多少用时间计算，生命的价值用贡献计算。——裴多菲

61、生命是以时间为单位的，浪费别人的时间等于谋财害命，
浪费自己的时间，等于慢性自杀。——鲁迅

62、时钟随着指针的移动滴答在响：“秒”是雄赳赳气昂昂列队行进的兵士，
“分”是士官，“小时”是带队冲锋陷阵的骁勇的军官，所以当你百无聊赖，
胡思乱想的时候，请记住你掌上有千军万马；你是他们的统帅。
检阅他们时，你不妨问问自己——他们是否在战斗中发挥了最大的作用。
——菲·蔡·约翰逊

63、睡得多的人学得少。

64、辛勤的蜜蜂永远没有时间的悲哀。——布莱克

65、时间象弹簧，可以缩短，也可以拉长。

66、丢失的牛羊可以找回；但是失去的时间却无法找回。——乔叟

67、我只惋惜一件事，日子太短，过得太快。一个人从来看不出做成什么，
只能看出还应该作什么？——居里夫人

68、人并不是因为美丽才可爱，而是因为可爱才美丽。——托尔斯泰

69、少而好学，如日出之阳；壮而好学，如日中之光；老而好学，
如炳烛之明。——刘向

70、如果你希望成功，当以恒心为良友，以经验为参谋，以当心为兄弟，
以希望为哨兵。——爱迪生

71、人的一生，是很短的，短暂的岁月要求我好好领会生活的进程……
——高尔基

72、生活得最有意义的人，并不就是年岁活得最大的人，而是对生活最有感受的人。——卢梭

73、人生应该如蜡烛一样，从顶燃到底，一直都是光明的。——萧楚女

74、善于利用零星时间的人，才会做出更大的成绩来。——华罗庚

75、如果是玫瑰，它总会开花的。——歌德

76、如果你浪费了自己的年龄，那是挺可悲的。因为你的青春只能持续
一点儿时间——很短的一点儿时间。——王尔德"""
    return famouses.split("\n\n")[random.randint(0,75)][3:]
def test():
    requests.get("https://www.baidu.com")
def getpjfs(link):
    img = Image.open(link)
    w,h=img.size 
    r,g,b=0,0,0
    img = img.convert('RGB')
    for x in range(w):
        for y in range(h):
            r1,g1,b1=img.getpixel((x,y))
            r+=r1
            g+=g1
            b+=b1
    if (r//(w*h)+g//(w*h)+b//(w*h))/3>=200:
        return "#000000"
    else:
        return "#FFFFFF"
    
def weather():
    try:
        reader = geoip2.database.Reader('./GeoLite2-City.mmdb')
        ip=getHostIp()
        response = reader.city(ip)
        city=response.city.names["zh-CN"]
        url=f"https://api.seniverse.com/v3/weather/daily.json?key=S7fyLm4jfkPpS7eDD&location={city}&language=zh-Hans&unit=c&start=0&days=5"
        content =requests.get(url)
        content.encoding="utf-8"
        content=content.text
        data =json.loads(content)
        res =data["results"][0]["daily"][0]
        if(datetime.datetime.now().hour>20):
            wea=res["text_day"]
        else:
            wea=res["text_night"]
        du=res["low"]+"~"+res["high"]+"℃"
        return wea,du
    except:
        return "未知","0~0℃"
if __name__=="__main__":
    print(getpjfs("image/README/1655690951385.png"))